Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/aic.h
/* -------- AIC_WPSR : (AIC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define AIC_WPSR_WPVS_Pos                     _U_(0)                                               /**< (AIC_WPSR) Write Protection Violation Status Position */
#define AIC_WPSR_WPVS_Msk                     (_U_(0x1) << AIC_WPSR_WPVS_Pos)                      /**< (AIC_WPSR) Write Protection Violation Status Mask */
#define AIC_WPSR_WPVS(value)                  (AIC_WPSR_WPVS_Msk & ((value) << AIC_WPSR_WPVS_Pos))
#define AIC_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (AIC_WPSR) Write Protection Violation Source Position */
#define AIC_WPSR_WPVSRC_Msk                   (_U_(0xFFFF) << AIC_WPSR_WPVSRC_Pos)                 /**< (AIC_WPSR) Write Protection Violation Source Mask */
#define AIC_WPSR_WPVSRC(value)                (AIC_WPSR_WPVSRC_Msk & ((value) << AIC_WPSR_WPVSRC_Pos))
#define AIC_WPSR_Msk                          _U_(0x00FFFF01)                                      /**< (AIC_WPSR) Register Mask  */


/* -------- AIC_VERSION : (AIC Offset: 0xFC) ( R/ 32) AIC Version Register -------- */
#define AIC_VERSION_VERSION_Pos               _U_(0)                                               /**< (AIC_VERSION) Version of the Hardware Module Position */
#define AIC_VERSION_VERSION_Msk               (_U_(0xFFF) << AIC_VERSION_VERSION_Pos)              /**< (AIC_VERSION) Version of the Hardware Module Mask */
#define AIC_VERSION_VERSION(value)            (AIC_VERSION_VERSION_Msk & ((value) << AIC_VERSION_VERSION_Pos))
#define AIC_VERSION_MFN_Pos                   _U_(16)                                              /**< (AIC_VERSION) Metal Fix Number Position */
#define AIC_VERSION_MFN_Msk                   (_U_(0x7) << AIC_VERSION_MFN_Pos)                    /**< (AIC_VERSION) Metal Fix Number Mask */
#define AIC_VERSION_MFN(value)                (AIC_VERSION_MFN_Msk & ((value) << AIC_VERSION_MFN_Pos))
#define AIC_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (AIC_VERSION) Register Mask  */


/** \brief AIC register offsets definitions */
#define AIC_SSR_REG_OFST               (0x00)              /**< (AIC_SSR) Source Select Register Offset */
#define AIC_SMR_REG_OFST               (0x04)              /**< (AIC_SMR) Source Mode Register Offset */
#define AIC_SVR_REG_OFST               (0x08)              /**< (AIC_SVR) Source Vector Register Offset */
#define AIC_IVR_REG_OFST               (0x10)              /**< (AIC_IVR) Interrupt Vector Register Offset */
#define AIC_FVR_REG_OFST               (0x14)              /**< (AIC_FVR) FIQ Vector Register Offset */
#define AIC_ISR_REG_OFST               (0x18)              /**< (AIC_ISR) Interrupt Status Register Offset */
#define AIC_IPR0_REG_OFST              (0x20)              /**< (AIC_IPR0) Interrupt Pending Register 0 Offset */
#define AIC_IPR1_REG_OFST              (0x24)              /**< (AIC_IPR1) Interrupt Pending Register 1 Offset */
#define AIC_IPR2_REG_OFST              (0x28)              /**< (AIC_IPR2) Interrupt Pending Register 2 Offset */
#define AIC_IPR3_REG_OFST              (0x2C)              /**< (AIC_IPR3) Interrupt Pending Register 3 Offset */
#define AIC_IMR_REG_OFST               (0x30)              /**< (AIC_IMR) Interrupt Mask Register Offset */
#define AIC_CISR_REG_OFST              (0x34)              /**< (AIC_CISR) Core Interrupt Status Register Offset */
#define AIC_EOICR_REG_OFST             (0x38)              /**< (AIC_EOICR) End of Interrupt Command Register Offset */
#define AIC_SPU_REG_OFST               (0x3C)              /**< (AIC_SPU) Spurious Interrupt Vector Register Offset */
#define AIC_IECR_REG_OFST              (0x40)              /**< (AIC_IECR) Interrupt Enable Command Register Offset */
#define AIC_IDCR_REG_OFST              (0x44)              /**< (AIC_IDCR) Interrupt Disable Command Register Offset */
#define AIC_ICCR_REG_OFST              (0x48)              /**< (AIC_ICCR) Interrupt Clear Command Register Offset */
#define AIC_ISCR_REG_OFST              (0x4C)              /**< (AIC_ISCR) Interrupt Set Command Register Offset */
#define AIC_FFER_REG_OFST              (0x50)              /**< (AIC_FFER) Fast Forcing Enable Register Offset */
#define AIC_FFDR_REG_OFST              (0x54)              /**< (AIC_FFDR) Fast Forcing Disable Register Offset */
#define AIC_FFSR_REG_OFST              (0x58)              /**< (AIC_FFSR) Fast Forcing Status Register Offset */
#define AIC_SVRRER_REG_OFST            (0x60)              /**< (AIC_SVRRER) SVR Return Enable Register Offset */
#define AIC_SVRRDR_REG_OFST            (0x64)              /**< (AIC_SVRRDR) SVR Return Disable Register Offset */
#define AIC_SVRRSR_REG_OFST            (0x68)              /**< (AIC_SVRRSR) SVR Return Status Register Offset */
#define AIC_DCR_REG_OFST               (0x6C)              /**< (AIC_DCR) Debug Control Register Offset */
#define AIC_WPMR_REG_OFST              (0xE4)              /**< (AIC_WPMR) Write Protection Mode Register Offset */
#define AIC_WPSR_REG_OFST              (0xE8)              /**< (AIC_WPSR) Write Protection Status Register Offset */
#define AIC_VERSION_REG_OFST           (0xFC)              /**< (AIC_VERSION) AIC Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief AIC register API structure */
typedef struct
{
  __IO  uint32_t                       AIC_SSR;            /**< Offset: 0x00 (R/W  32) Source Select Register */
  __IO  uint32_t                       AIC_SMR;            /**< Offset: 0x04 (R/W  32) Source Mode Register */
  __IO  uint32_t                       AIC_SVR;            /**< Offset: 0x08 (R/W  32) Source Vector Register */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       AIC_IVR;            /**< Offset: 0x10 (R/   32) Interrupt Vector Register */
  __I   uint32_t                       AIC_FVR;            /**< Offset: 0x14 (R/   32) FIQ Vector Register */
  __I   uint32_t                       AIC_ISR;            /**< Offset: 0x18 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       AIC_IPR0;           /**< Offset: 0x20 (R/   32) Interrupt Pending Register 0 */
  __I   uint32_t                       AIC_IPR1;           /**< Offset: 0x24 (R/   32) Interrupt Pending Register 1 */
  __I   uint32_t                       AIC_IPR2;           /**< Offset: 0x28 (R/   32) Interrupt Pending Register 2 */
  __I   uint32_t                       AIC_IPR3;           /**< Offset: 0x2C (R/   32) Interrupt Pending Register 3 */
  __I   uint32_t                       AIC_IMR;            /**< Offset: 0x30 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       AIC_CISR;           /**< Offset: 0x34 (R/   32) Core Interrupt Status Register */
  __O   uint32_t                       AIC_EOICR;          /**< Offset: 0x38 ( /W  32) End of Interrupt Command Register */
  __IO  uint32_t                       AIC_SPU;            /**< Offset: 0x3C (R/W  32) Spurious Interrupt Vector Register */
  __O   uint32_t                       AIC_IECR;           /**< Offset: 0x40 ( /W  32) Interrupt Enable Command Register */
  __O   uint32_t                       AIC_IDCR;           /**< Offset: 0x44 ( /W  32) Interrupt Disable Command Register */
  __O   uint32_t                       AIC_ICCR;           /**< Offset: 0x48 ( /W  32) Interrupt Clear Command Register */
  __O   uint32_t                       AIC_ISCR;           /**< Offset: 0x4C ( /W  32) Interrupt Set Command Register */
  __O   uint32_t                       AIC_FFER;           /**< Offset: 0x50 ( /W  32) Fast Forcing Enable Register */
  __O   uint32_t                       AIC_FFDR;           /**< Offset: 0x54 ( /W  32) Fast Forcing Disable Register */
  __I   uint32_t                       AIC_FFSR;           /**< Offset: 0x58 (R/   32) Fast Forcing Status Register */
  __I   uint8_t                        Reserved3[0x04];
  __O   uint32_t                       AIC_SVRRER;         /**< Offset: 0x60 ( /W  32) SVR Return Enable Register */
  __O   uint32_t                       AIC_SVRRDR;         /**< Offset: 0x64 ( /W  32) SVR Return Disable Register */
  __I   uint32_t                       AIC_SVRRSR;         /**< Offset: 0x68 (R/   32) SVR Return Status Register */
  __IO  uint32_t                       AIC_DCR;            /**< Offset: 0x6C (R/W  32) Debug Control Register */
  __I   uint8_t                        Reserved4[0x74];
  __IO  uint32_t                       AIC_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       AIC_WPSR;           /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved5[0x10];
  __I   uint32_t                       AIC_VERSION;        /**< Offset: 0xFC (R/   32) AIC Version Register */
} aic_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_AIC_COMPONENT_H_ */
